{
  "backend/main.mo": "Motoko backend managing posts and user profiles with access control, supporting CRUD operations and profile retrieval with authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to their relevant files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind-based theme variables and base styles for light and dark modes using OKLCH color tokens.",
  "frontend/index.html": "Base HTML template loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React entry component configuring TanStack Router routes and theme provider.",
  "frontend/src/components/auth/IdentityIndicator.tsx": "Badge displaying the current user's profile name or principal when authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity authentication and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting first-time users to enter and save their display name.",
  "frontend/src/components/layout/AppHeader.tsx": "Page header with banner, logo, navigation, identity indicator, and authentication button.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout containing header, routed content outlet, footer, and profile setup dialog.",
  "frontend/src/components/posts/PostActions.tsx": "Provides edit and delete buttons for a post, including a confirmation dialog and delete mutation handling.",
  "frontend/src/components/posts/PostCard.tsx": "Displays a preview card for a post with title, truncated body, author snippet, and timestamp.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and updates the caller’s user profile using actor-based queries and mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity login, state management, and persistence using AuthClient and React context.",
  "frontend/src/hooks/usePosts.ts": "Provides queries and mutations for listing, fetching, creating, updating, and deleting posts via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and warm-themed light/dark CSS variables for global styling.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider.",
  "frontend/src/pages/PostDetailPage.tsx": "Shows full post content, author info, and edit/delete actions for the author, with loading and error handling.",
  "frontend/src/pages/PostEditorPage.tsx": "Provides a post creation and editing form, handling authentication checks, loading states, and saving posts via create or update hooks.",
  "frontend/src/pages/PostsFeedPage.tsx": "Displays the posts feed with loading and error states, showing posts or empty-state messaging and offering a new-post link for authenticated users.",
  "frontend/src/utils/format.ts": "Utility functions for formatting timestamps into readable dates and truncating principal strings.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and container settings with custom plugins.",
  "project_state.json": "Project metadata describing current features, pending requests, assets requirements, and overall app objectives."
}