{
  "backend/main.mo": "Main canister logic managing posts and user profiles with authorization checks, mandatory photo field enforcement, and CRUD operations on posts.",
  "backend/migration.mo": "Migration module converting old posts to the new format by adding a default photo field and returning an updated actor state.",
  "feature_evidence.json": "Feature evidence report mapping frontend files to implemented photo‑related features with associated components and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file across the project.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables for light and dark themes and applying shared border/background defaults.",
  "frontend/index.html": "Base HTML template mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, routes, theme provider, and global toaster for the React app.",
  "frontend/src/components/auth/IdentityIndicator.tsx": "Shows the current user's profile name or truncated principal in a badge when authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with query cache reset on sign‑out.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting first‑time users to enter and save their name, with validation and loading states.",
  "frontend/src/components/layout/AppHeader.tsx": "Header containing banner, logo, navigation, and authentication UI with identity display.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout with header, routed main content, footer, and profile‑setup dialog.",
  "frontend/src/components/posts/PostActions.tsx": "Post action bar for authors providing edit navigation and a delete confirmation dialog.",
  "frontend/src/components/posts/PostCard.tsx": "Displays a clickable post card with title, preview text, photo (or fallback), author snippet, and timestamp.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity state and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and saves the caller's user profile using the backend actor and react‑query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login and logout functions.",
  "frontend/src/hooks/usePosts.ts": "Provides react‑query hooks for listing, fetching, creating, updating, and deleting posts via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/PostDetailPage.tsx": "Renders a full post view with photo, metadata, author check, and edit/delete actions for the owner.",
  "frontend/src/pages/PostEditorPage.tsx": "Handles creating and editing posts, including title/body fields, image upload, validation, and save operations.",
  "frontend/src/pages/PostsFeedPage.tsx": "Renders the main posts feed with authentication-aware UI, loading/error states, and lists PostCard components.",
  "frontend/src/utils/format.ts": "Provides date/time formatting helpers and principal string truncation.",
  "frontend/src/utils/photos.ts": "Implements image validation, file-to-dataURL conversion, preview utilities, and photo-related helpers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theming, typography, colors, animations, and plugin setup.",
  "project_state.json": "Describes the project’s state, existing features, and pending feature requests for the family blog app."
}