{
  "kind": "build_request",
  "title": "Make a photo mandatory for every blog post",
  "projectName": "Family Blog",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Update the backend post data model and APIs so every post includes a required photo, and enforce that photo is present when creating or updating a post.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add a feature to make photo mandatory in the blog"
        ]
      },
      "acceptanceCriteria": [
        "The backend Post type includes fields to store a post photo (image bytes) and its content type (e.g., \"image/jpeg\").",
        "createPost rejects (traps) if no photo is provided or the provided photo is empty.",
        "updatePost rejects (traps) if no photo is provided or the provided photo is empty (i.e., a post cannot be saved without a photo).",
        "Existing authorization rules remain unchanged (only users can create; only author/admin can update/delete).",
        "The generated candid/TS bindings are updated so the frontend can send/receive the photo fields."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Update the post editor UI (create and edit) to require a photo before allowing a post to be published or updated, including clear validation messaging.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add a feature to make photo mandatory in the blog"
        ]
      },
      "acceptanceCriteria": [
        "The post editor form includes a photo input control (file picker) that accepts common image types.",
        "On create: attempting to publish without selecting a photo shows an English validation error (e.g., \"Please add a photo\") and does not call the create mutation.",
        "On edit: the editor shows the existing post photo; saving is blocked unless the post has a photo (existing or newly selected), and attempting to save without a photo shows an English validation error.",
        "When a photo is selected, the UI shows a preview of the image before saving.",
        "Create/update mutations send the photo data and content type along with title/body to the backend."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Render the post photo in the posts feed cards and on the post detail page so readers can see the mandatory image for each post.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add a feature to make photo mandatory in the blog"
        ]
      },
      "acceptanceCriteria": [
        "PostsFeedPage/PostCard displays the post photo thumbnail/preview for each post.",
        "PostDetailPage displays the post photo prominently near the top of the post content.",
        "If an unexpected post record without a photo is encountered (e.g., older data), the UI renders a clear fallback state without crashing (e.g., placeholder box + \"Photo unavailable\")."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or other frontend immutable paths listed in SYSTEM_CONTEXT; compose those components instead."
  ],
  "nonGoals": [
    "Supporting multiple photos per post.",
    "Image editing tools (crop/rotate/filters) in the editor.",
    "External image hosting/CDN integration."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}