{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Family Blog - Require and display a mandatory post photo",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Require a photo in the post editor (create/edit), with validation messaging, preview, and sending photo data to the backend.",
      "acceptanceCriteria": [
        "The post editor form includes a photo input control (file picker) that accepts common image types.",
        "On create: attempting to publish without selecting a photo shows an English validation error (e.g., \"Please add a photo\") and does not call the create mutation.",
        "On edit: the editor shows the existing post photo; saving is blocked unless the post has a photo (existing or newly selected), and attempting to save without a photo shows an English validation error.",
        "When a photo is selected, the UI shows a preview of the image before saving.",
        "Create/update mutations send the photo data and content type along with title/body to the backend."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/photos.ts",
          "operation": "create",
          "description": "Add frontend-only helpers to (1) validate selected image files, (2) read a File into the backend-compatible payload (bytes/base64 per updated bindings) plus content type, and (3) create a safe preview src for UI rendering."
        },
        {
          "path": "frontend/src/hooks/usePosts.ts",
          "operation": "modify",
          "description": "Update create/update mutations to accept and forward required photo payload (photo bytes/base64 + content type) alongside title/body, matching the updated generated TS bindings (no create/update call should omit photo)."
        },
        {
          "path": "frontend/src/pages/PostEditorPage.tsx",
          "operation": "modify",
          "description": "Add a required photo picker (accept common image types), show an inline preview, prefill and display the existing post photo while editing, and add English validation that blocks publish/update and prevents calling the create/update mutations when no photo (existing or newly selected) is available."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Align frontend type declarations with the regenerated bindings for mandatory post photo fields (post photo bytes + content type, and updated createPost/updatePost signatures) so the editor can send/receive the required photo data."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Display the post photo in the feed cards and post detail page, with a safe fallback if missing.",
      "acceptanceCriteria": [
        "PostsFeedPage/PostCard displays the post photo thumbnail/preview for each post.",
        "PostDetailPage displays the post photo prominently near the top of the post content.",
        "If an unexpected post record without a photo is encountered (e.g., older data), the UI renders a clear fallback state without crashing (e.g., placeholder box + \"Photo unavailable\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/posts/PostCard.tsx",
          "operation": "modify",
          "description": "Render a post photo thumbnail/preview within the feed card using the shared photo rendering helper; if the post record lacks photo data, render a non-crashing placeholder state with clear text (e.g., \"Photo unavailable\")."
        },
        {
          "path": "frontend/src/pages/PostDetailPage.tsx",
          "operation": "modify",
          "description": "Render the post photo prominently near the top of the post detail view using the shared photo rendering helper; if the post record lacks photo data, render a clear fallback placeholder without crashing."
        },
        {
          "path": "frontend/src/utils/photos.ts",
          "operation": "modify",
          "description": "Add/extend helper(s) to convert the stored post photo representation from the updated bindings into a browser-renderable image src (and detect missing/empty photo for fallback rendering)."
        }
      ]
    }
  ]
}